frolk/scale-driver_nrf52/main.c
}


void gpio_init()
{
	nrf_gpio_cfg_output(RED_PIN);
	nrf_gpio_cfg_output(GREEN_PIN);
	nrf_gpio_cfg_output(BLUE_PIN);
}







int main(void)
{
	nrf_gpiote();
	
	//rgb_set(GREEN, 2);
		uint32_t err_code;
	bool erase_bonds;

    // Initialize.
		//fds_read_value(pwm_point, file_id_update, rec_key_update);
		//pwm_value = *pwm_point;
		uart_init();
    log_init();
    timers_init();
    ble_stack_init();
    peer_manager_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
		pwm_init_corr();
		pwm_init_rgb();
		
	//	SEGGER_RTT_printf(0, "%s with pwm_value = %d\n", "start application", pwm_value);
		
		//NRF_LOG_INFO("HEllo");
    // Start execution.
    application_timers_start();
    advertising_start(erase_bonds);
		HX711_init();
		
		err_code = fds_test_init();
	//	APP_ERROR_CHECK(err_code);
	//	err_code = fds_write_value(&pwm_value);
//		err_code = fds_test_find_and_delete();
		//APP_ERROR_CHECK(err_code);
   		err_code = fds_write_value(&pwm_value, file_id, fds_rk_cor1);
  		APP_ERROR_CHECK(err_code);
    	while(write_flag == 0);
			err_code = fds_write_value(&pwm_value2, file_id, fds_rk_cor2);
  		APP_ERROR_CHECK(err_code);
//		err_code = fds_read();
	//	gpio_init();
		//rgb_set(50, 0, 0, 0);
		
//	nrf_gpio_pin_clear(RED_PIN);
//	nrf_gpio_pin_clear(GREEN_PIN);
//	nrf_gpio_pin_set(BLUE_PIN);
		


    // Enter main loop.
    for (;;)
    {
			Weighing();
			//SEGGER_RTT_printf(0, "%d\n", adc_value);
			//nrf_delay_ms(500);
		//	SEGGER_RTT_printf(0, "%s\n", "privet");
			
//        if (NRF_LOG_PROCESS() == false)
//        {
//            power_manage();
//        }
    }
}
